In [3]:
%matplotlib inline
import numpy as np
import matplotlib.pyplot as plt
import pandas as pd

In [4]:
mydata = np.random.randn(4,3)

In [5]:
mydata

array([[-1.04709778,  1.21860608,  1.42244848],
       [-0.81968614, -0.56156649,  0.39549864],
       [ 1.18461417, -0.73946012, -0.7327488 ],
       [-1.02326338,  0.04651023, -0.60566012]])

In [6]:
list("ABCDE")

['A', 'B', 'C', 'D', 'E']

In [7]:
df1 = pd.DataFrame(mydata, columns = list("ABC"))

In [8]:
df1

          A         B         C
0 -1.047098  1.218606  1.422448
1 -0.819686 -0.561566  0.395499
2  1.184614 -0.739460 -0.732749
3 -1.023263  0.046510 -0.605660

In [11]:
df2 = pd.DataFrame(np.random.randn(3,3), columns = list("ABC"))

In [12]:
df2

          A         B         C
0  1.050173  0.860223 -0.324910
1  0.407937  1.325358 -2.132982
2  0.362372  0.017024 -0.930460

In [13]:
df3 = pd.concat([df2,df1], axis = 0)     #0是上下，1是左右
df3

          A         B         C
0  1.050173  0.860223 -0.324910
1  0.407937  1.325358 -2.132982
2  0.362372  0.017024 -0.930460
0 -1.047098  1.218606  1.422448
1 -0.819686 -0.561566  0.395499
2  1.184614 -0.739460 -0.732749
3 -1.023263  0.046510 -0.605660

In [14]:
df3.index= range(7)

In [15]:
df3

          A         B         C
0  1.050173  0.860223 -0.324910
1  0.407937  1.325358 -2.132982
2  0.362372  0.017024 -0.930460
3 -1.047098  1.218606  1.422448
4 -0.819686 -0.561566  0.395499
5  1.184614 -0.739460 -0.732749
6 -1.023263  0.046510 -0.605660

In [16]:
df4 = pd.concat([df1,df2], axis=1)
df4

          A         B         C         A         B         C
0 -1.047098  1.218606  1.422448  1.050173  0.860223 -0.324910
1 -0.819686 -0.561566  0.395499  0.407937  1.325358 -2.132982
2  1.184614 -0.739460 -0.732749  0.362372  0.017024 -0.930460
3 -1.023263  0.046510 -0.605660       NaN       NaN       NaN